{
  "name": "Challah",
  "duration": 3,
  "tags": ["hanukkah", "bread", "rosh hashanah"],
  "servings": 6,
  "ingredients": [
    "2 packages – Active Dry Yeast",
    "¼ cup – Sugar (or substitute with honey)",
    "1¼ cups – Warm Water (105–115°F)",
    "5 to 6 cups – Bread Flour",
    "1 tbsp – Salt",
    "3 – Large Eggs (*see note for substitution)",
    "¼ cup – Vegetable Shortening",
    "As Needed – Handful of Sesame or Poppy Seeds (optional topping)",
    "As Needed – Cornmeal for Dusting"
  ],
  "instructions": [
    "In a large container dissolve the yeast and a pinch of sugar in 1 cup of the warm water (105 to 115 degrees) and let stand for 10 minutes.",
    "Place the flour in a large bowl. Add the dissolved yeast and stir with a spoon. Add the remaining sugar, salt, 2 eggs,* and the vegetable shortening. Beat about one minute and then mix by hand. When the dough begins to leave the side of the bowl, turn it onto a lightly floured surface to knead. You can also use a dough hook in a mixer to blend and knead.",
    "Note: For Rosh Hashanah, add raisins",
    "Knead for about 15 minutes or until soft, adding more water or flour as necessary.",
    "Place the dough in a lightly greased bowl, turning the dough over so that the entire surface is lightly greased; cover the bowl with a cloth. Let rise in a warm place (75 to 80 degrees) for about an hour or until the dough doubles in size. Punch down and divide into 2 balls.",
    "Divide each ball into 6 snake-like pieces and roll out, about 12 inches long.",
    "Place all 6 strands on a board side by side, pressing the 6 ends together. Divide into 2 groups of 3 strands; use shorter strands for thicker challah",
    "Now braid the 6 strands. Take the strand from the extreme left and place it over the other 2 and into the center. Take the second from the right and place it over the top to the far left. Take the one from the far right to what is now the center of your 6 strips. Then take the second one from the left and put it to the far right and take the far outside on the left to what is now the center. Go back to the right side and take the second from the right and put it over to the far left. Always work with the 2 outside strands. Continue braiding until the dough is used up. When you have finished squeeze the ends together. Repeat with the second loaf.",
    "For those who want less of a challenge, divide each ball into 3 strands and braid. Place the outside strip over the middle one, then under the third. Pull the strips tight. Continue braiding. (Mr. Loeb braids half way through and then flips the challah, continuing to braid to the end. This way he gets a more even braid.) When finished braiding, tuck in the ends. Repeat with the remaining 3 strips.",
    "Using a pastry brush, brush the challah with the remaining egg mixed with water and sprinkle with sesame or poppy seeds. After you have brushed the bread, dip your second finger in the egg wash and indent the top of the braids. Then dip your finger in the seeds and touch the indented area again to make a more striking design.",
    "Sprinkle a cookie sheet with cornmeal and place the loaves on top. Cover with a plastic sheet and let rise for 30 minutes in a warm place.",
    "Bake in a preheated 375-degree oven for about 30 minutes or until golden."
  ],
  "additional_context": {
    "source": "Adapted from Jewish Cooking in America book at the Farm",
    "story": "",
    "tips": ""
  }
}
