{
  "name": "Cinnamon Buns Slow",
  "duration": 3.5,
  "tags": ["sweet", "christmas", "muffins" ],
  "servings": 18,
  "ingredients": [
    "1 ½ cup – Milk",
    "3 tbsp – Butter",
    "3 tbsp – Sugar",
    "½ tbsp – Salt",
    "½ tsp – Sugar",
    "¼ cup – Warm Water",
    "2 ¼ tsp – Yeast (a little more won’t hurt)",
    "1 large – Egg",
    "2-3 cup – All Purpose Flour",
    "⅓ cup – Melted Butter (for filling)",
    "¾ cup – Sugar (for filling)",
    "1 tbsp – Cinnamon (for filling)"
  ],
  "instructions": [
    "Scald milk",
    "Stir in butter, sugar, salt ",
    "Cool milk mixture to lukewarm",
    "Dissolve ½ tsp sugar in warm water,sprinkle in yeast",
    "Let stand for 10 minutes",
    "Combine milk mixture and egg, stir in yeast mixture",
    "Add flour and beat well for 10 minutes",
    "With a wooden spoon gradually add remaining flour to make a soft dough",
    "Turn out onto lightly floured surface and knead until smooth and elastic (adding more flour is needed)",
    "Let dough rise in a warm place in a greased bowl with a towel on top until double in size (~60 mins)",
    "Punch down dough, drop onto lightly floured surface and divide in half",
    "Roll out into ~ 23x46cm rectangle at ~ 1cm thick, make one edge a little thinner which will become the outside roll",
    "Brush melted butter generously onto flattened dough, leaving ½ inch to seal buns  ",
    "Sprinkle filling (sugar and cinnamon) mixture on top",
    "Roll yumminess up from long-side (use lift + tuck method), first few rolls will be very tight, cut into 5 cm slices (should make ~18 buns)",
    "Place excess melted butter in baking pan, place slices on pan with a greased wax paper cover",
    "Let rise again until double in size (45-60 minutes)",
    "When there is about 15 minutes left in the last rise, preheat oven to 400˚F",
    "Bake for 30 minutes, up to 45 minutes",
    "After cooling, flip out of pan to serve after baking"
  ],
  "additional_context": {
    "source": "These are made every year at Christmas by Isaac's mom! They take a long time to make, but are so worth it!",
    "story": "",
    "tips": "More cinnamon doesn't actually make it better. If its really cold in the morning, add a little extra yeast to help it rise. Rise in a warm place, like the oven when it's off but with a pot of boiled water. "
  }
}
