{
  "name": "French Onion Soup",
  "duration": 8,
  "tags": ["soup"],
  "servings": 4,
  "ingredients": [
    "2 large – Onions, sweet (Spanish or Bermuda)",
    "1/2 cup – Butter",
    "1 clove – Garlic, crushed",
    "3 tbsp – Flour",
    "1 tsp – Salt",
    "2 cubes – Beef Bouillon like McCormicks",
    "1 – Baguette, sliced 1/2 inch thick or sourdough buns",
    "1 lb – Swiss Emmentaler Cheese, grated"
  ],
  "instructions": [
    "Peel and thinly slice onions, separate slices into rings",
    "In Dutch oven, melt butter over medium heat",
    "Increase temperature to high heat and add onions, stirring frequently until they appear almost burnt (quite brown with the odd black bit)",
    "Reduce heat to low and add garlic, saute until garlic is soft; don’t allow garlic to brown",
    "Add 10 cups of hot water, with beef bouillon and return to a boil, reduce to a simmer, leave uncovered until reduced by half, ~5-7 hours",
    "In a medium skilled make a brown roux with the flour and remaining butter (https://toleiko.ca/recipes/recipe.html?recipe=roux).",
    "Add a couple tablespoons of the hot stock to the roux, stirring constantly",
    "Preheat oven to boiling",
    "Add this to the stock pot and stir constantly, let boil for ~5 minutes until slightly thicker and to eliminate the taste of raw flour",
    "Add the salt",
    "Serving: either in 4 onion-soup bowls, place a couple tablespoons of shredded cheese or in sourdough buns, cut out the center to make a bowl then place a couple tablespoons of shredded cheese in the makeshift bowl",
    "Ladle soup to within 1/2 inch of the top of each bowl",
    "cover soup with toasted baguette slices and add a bit more cheese (ensure the baguette and cheese don’t sink)",
    "Place under broiler until cheese is melted and starting to brown"
  ],
  "additional_context": {
    "source": "",
    "story": "Isaac made this very early on for Tori when they first started dating. At the time Tori was vegetarian and Isaac adapted the recipe to be vegetarian for her. They then stayed up until 3 or 4 in the morning talking to each other over bowls of this soup.",
    "tips": "The longer the onions cook, the better! "
  }
}
